apache/nuttx/arch/arm/src/kinetis/kinetis_lpserial.c
/****************************************************************************
 * arch/arm/src/kinetis/kinetis_lpserial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>
#include <nuttx/spinlock.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <arch/board/board.h>

#include "arm_internal.h"
#include "kinetis_config.h"
#include "chip.h"
#include "hardware/kinetis_lpuart.h"
#include "hardware/kinetis_pinmux.h"
#include "hardware/kinetis_dmamux.h"
#include "kinetis.h"
#include "kinetis_lpuart.h"
#include "kinetis_edma.h"
/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some sanity checks *******************************************************/

/* Is there at least one LPUART enabled and configured as a RS-232 device? */

#ifndef HAVE_LPUART_DEVICE
#  warning "No LPUARTs enabled"
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#if defined(HAVE_LPUART_DEVICE) && defined(USE_SERIALDRIVER)

/* Assume DMA is not used on the console UART */

#undef SERIAL_HAVE_CONSOLE_DMA

/* Which LPUART with be tty0/console and which tty1?  The console will always
 * be ttyS0.  If there is no console then will use the lowest numbered
 * LPUART.
 */

/* First pick the console and ttys0.  This could be any of LPUART0-4 */

#if defined(CONFIG_LPUART0_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_lpuart0port /* LPUART0 is console */
#    define TTYS0_DEV           g_lpuart0port /* LPUART0 is ttyS0 */
#    define LPUART0_ASSIGNED    1
#  if defined(CONFIG_KINETIS_LPUART0_RXDMA)
#    define SERIAL_HAVE_CONSOLE_DMA 1
#  endif
#elif defined(CONFIG_LPUART1_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_lpuart1port /* LPUART1 is console */
#    define TTYS0_DEV           g_lpuart1port /* LPUART1 is ttyS0 */
#    define LPUART1_ASSIGNED    1
#  if defined(CONFIG_KINETIS_LPUART1_RXDMA)
#    define SERIAL_HAVE_CONSOLE_DMA 1
#  endif
#elif defined(CONFIG_LPUART2_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_lpuart2port /* LPUART2 is console */
#    define TTYS0_DEV           g_lpuart2port /* LPUART2 is ttyS0 */
#    define LPUART2_ASSIGNED    1
#  if defined(CONFIG_KINETIS_LPUART2_RXDMA)
#    define SERIAL_HAVE_CONSOLE_DMA 1
#  endif
#elif defined(CONFIG_LPUART3_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_lpuart3port /* LPUART3 is console */
#    define TTYS0_DEV           g_lpuart3port /* LPUART3 is ttyS0 */
#    define LPUART3_ASSIGNED    1
#  if defined(CONFIG_KINETIS_LPUART3_RXDMA)
#    define SERIAL_HAVE_CONSOLE_DMA 1
#  endif
#elif defined(CONFIG_LPUART4_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_lpuart4port /* LPUART4 is console */
#    define TTYS0_DEV           g_lpuart4port /* LPUART4 is ttyS0 */
#    define LPUART4_ASSIGNED    1
#  if defined(CONFIG_KINETIS_LPUART4_RXDMA)
#    define SERIAL_HAVE_CONSOLE_DMA 1
#  endif
#else
#  undef CONSOLE_DEV                          /* No console */
#  if defined(CONFIG_KINETIS_LPUART0)
#    define TTYS0_DEV           g_lpuart0port /* LPUART0 is ttyS0 */
#    define LPUART0_ASSIGNED    1
#  elif defined(CONFIG_KINETIS_LPUART1)
#    define TTYS0_DEV           g_lpuart1port /* LPUART1 is ttyS0 */
#    define LPUART1_ASSIGNED    1
#  elif defined(CONFIG_KINETIS_LPUART2)
#    define TTYS0_DEV           g_lpuart2port /* LPUART2 is ttyS0 */
#    define LPUART2_ASSIGNED    1
#  elif defined(CONFIG_KINETIS_LPUART3)
#    define TTYS0_DEV           g_lpuart3port /* LPUART3 is ttyS0 */
#    define LPUART3_ASSIGNED    1
#  elif defined(CONFIG_KINETIS_LPUART4)
#    define TTYS0_DEV           g_lpuart4port /* LPUART4 is ttyS0 */
#    define LPUART4_ASSIGNED    1
#  endif
#endif

/* Pick ttys1. This could be any of LPUART0-4 excluding the console/ttyS0
 * LPUART.
 */

#if defined(CONFIG_KINETIS_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS1_DEV             g_lpuart0port /* LPUART0 is ttyS1 */
#  define LPUART0_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS1_DEV             g_lpuart1port /* LPUART1 is ttyS1 */
#  define LPUART1_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS1_DEV             g_lpuart2port /* LPUART2 is ttyS1 */
#  define LPUART2_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS1_DEV             g_lpuart3port /* LPUART3 is ttyS1 */
#  define LPUART3_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS1_DEV             g_lpuart4port /* LPUART4 is ttyS1 */
#  define LPUART4_ASSIGNED      1
#endif

/* Pick ttys2. This could be any of LPUART1-4 excluding the console/ttyS0
 * LPUART.
 */

#if defined(CONFIG_KINETIS_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS2_DEV             g_lpuart1port /* LPUART1 is ttyS2 */
#  define LPUART1_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS2_DEV             g_lpuart2port /* LPUART2 is ttyS2 */
#  define LPUART2_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS2_DEV             g_lpuart3port /* LPUART3 is ttyS2 */
#  define LPUART3_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS2_DEV             g_lpuart4port /* LPUART4 is ttyS2 */
#  define LPUART4_ASSIGNED      1
#endif

/* Pick ttys3. This could be any of LPUART2-4 excluding the console/ttyS0
 * LPUART.
 */

#if defined(CONFIG_KINETIS_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS3_DEV             g_lpuart2port /* LPUART2 is ttyS3 */
#  define LPUART2_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS3_DEV             g_lpuart3port /* LPUART3 is ttyS3 */
#  define LPUART3_ASSIGNED      1
#elif defined(CONFIG_KINETIS_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS3_DEV             g_lpuart4port /* LPUART4 is ttyS3 */
#  define LPUART4_ASSIGNED      1
#endif

