apache/nuttx/arch/arm/src/kinetis/kinetis_lpserial.c
#ifdef LPSERIAL_HAVE_DMA
static const struct uart_ops_s g_lpuart_dma_ops =
{
  .setup          = kinetis_dma_setup,
  .shutdown       = kinetis_dma_shutdown,
  .attach         = kinetis_attach,
  .detach         = kinetis_detach,
  .ioctl          = kinetis_ioctl,
  .receive        = kinetis_dma_receive,
  .rxint          = kinetis_rxint,
  .rxavailable    = kinetis_dma_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = kinetis_rxflowcontrol,
#endif
  .send           = kinetis_send,
  .txint          = kinetis_txint,
  .txready        = kinetis_txready,
  .txempty        = kinetis_txready,
};
#endif

/* I/O buffers */

#ifdef CONFIG_KINETIS_LPUART0
static char g_lpuart0rxbuffer[CONFIG_LPUART0_RXBUFSIZE];
static char g_lpuart0txbuffer[CONFIG_LPUART0_TXBUFSIZE];
#  ifdef CONFIG_KINETIS_LPUART0_RXDMA
static char g_lpuart0rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(ARMV7M_DCACHE_LINESIZE);
#  endif
#endif
#ifdef CONFIG_KINETIS_LPUART1
static char g_lpuart1rxbuffer[CONFIG_LPUART1_RXBUFSIZE];
static char g_lpuart1txbuffer[CONFIG_LPUART1_TXBUFSIZE];
#  ifdef CONFIG_KINETIS_LPUART1_RXDMA
static char g_lpuart1rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(ARMV7M_DCACHE_LINESIZE);
#  endif
#endif
#ifdef CONFIG_KINETIS_LPUART2
static char g_lpuart2rxbuffer[CONFIG_LPUART2_RXBUFSIZE];
static char g_lpuart2txbuffer[CONFIG_LPUART2_TXBUFSIZE];
#  ifdef CONFIG_KINETIS_LPUART2_RXDMA
static char g_lpuart2rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(ARMV7M_DCACHE_LINESIZE);
#  endif
#endif
#ifdef CONFIG_KINETIS_LPUART3
static char g_lpuart3rxbuffer[CONFIG_LPUART3_RXBUFSIZE];
static char g_lpuart3txbuffer[CONFIG_LPUART3_TXBUFSIZE];
#  ifdef CONFIG_KINETIS_LPUART3_RXDMA
static char g_lpuart3rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(ARMV7M_DCACHE_LINESIZE);
#  endif
#endif
#ifdef CONFIG_KINETIS_LPUART4
static char g_lpuart4rxbuffer[CONFIG_LPUART4_RXBUFSIZE];
static char g_lpuart4txbuffer[CONFIG_LPUART4_TXBUFSIZE];
#  ifdef CONFIG_KINETIS_LPUART4_RXDMA
static char g_lpuart4rxfifo[RXDMA_BUFFER_SIZE]
  aligned_data(ARMV7M_DCACHE_LINESIZE);
#  endif
#endif

/* This describes the state of the Kinetis LPUART0 port. */

#ifdef CONFIG_KINETIS_LPUART0
static struct kinetis_dev_s g_lpuart0priv =
{
  .uartbase       = KINETIS_LPUART0_BASE,
  .clock          = BOARD_LPUART0_FREQ,
  .baud           = CONFIG_LPUART0_BAUD,
  .irq            = KINETIS_IRQ_LPUART0,
  .parity         = CONFIG_LPUART0_PARITY,
  .bits           = CONFIG_LPUART0_BITS,
  .stop2          = CONFIG_LPUART0_2STOP,
  .lock           = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART0_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = PIN_LPUART0_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART0_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = PIN_LPUART0_RTS,
#endif
#ifdef CONFIG_KINETIS_LPUART0_RXDMA
  .rxdma_reqsrc   = KINETIS_DMA_REQUEST_SRC_LPUART0_RX,
  .rxfifo         = g_lpuart0rxfifo,
#endif
};

static uart_dev_t g_lpuart0port =
{
  .recv     =
  {
    .size   = CONFIG_LPUART0_RXBUFSIZE,
    .buffer = g_lpuart0rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_LPUART0_TXBUFSIZE,
    .buffer = g_lpuart0txbuffer,
  },
#ifdef CONFIG_KINETIS_LPUART0_RXDMA
  .ops        = &g_lpuart_dma_ops,
#else
  .ops        = &g_lpuart_ops,
#endif
  .priv     = &g_lpuart0priv,
};
#endif

/* This describes the state of the Kinetis LPUART1 port. */

#ifdef CONFIG_KINETIS_LPUART1
static struct kinetis_dev_s g_lpuart1priv =
{
  .uartbase       = KINETIS_LPUART1_BASE,
  .clock          = BOARD_CORECLK_FREQ,
  .baud           = BOARD_LPUART1_FREQ,
  .irq            = KINETIS_IRQ_LPUART1,
  .parity         = CONFIG_LPUART1_PARITY,
  .bits           = CONFIG_LPUART1_BITS,
  .stop2          = CONFIG_LPUART1_2STOP,
  .lock           = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART1_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = PIN_LPUART1_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART1_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = PIN_LPUART1_RTS,
#endif
#ifdef CONFIG_KINETIS_LPUART1_RXDMA
  .rxdma_reqsrc   = KINETIS_DMA_REQUEST_SRC_LPUART1_RX,
  .rxfifo         = g_lpuart1rxfifo,
#endif
};

static uart_dev_t g_lpuart1port =
{
  .recv     =
  {
    .size   = CONFIG_LPUART1_RXBUFSIZE,
    .buffer = g_lpuart1rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_LPUART1_TXBUFSIZE,
    .buffer = g_lpuart1txbuffer,
  },
#ifdef CONFIG_KINETIS_LPUART1_RXDMA
  .ops        = &g_lpuart_dma_ops,
#else
  .ops        = &g_lpuart_ops,
#endif
  .priv     = &g_lpuart1priv,
};
#endif

/* This describes the state of the Kinetis LPUART2 port. */

#ifdef CONFIG_KINETIS_LPUART2
static struct kinetis_dev_s g_lpuart2priv =
{
  .uartbase       = KINETIS_LPUART2_BASE,
  .clock          = BOARD_CORECLK_FREQ,
  .baud           = BOARD_LPUART2_FREQ,
  .irq            = KINETIS_IRQ_LPUART2,
  .parity         = CONFIG_LPUART2_PARITY,
  .bits           = CONFIG_LPUART2_BITS,
  .stop2          = CONFIG_LPUART2_2STOP,
  .lock           = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART2_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = PIN_LPUART2_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART2_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = PIN_LPUART2_RTS,
#endif
#ifdef CONFIG_KINETIS_LPUART2_RXDMA
  .rxdma_reqsrc   = KINETIS_DMA_REQUEST_SRC_LPUART2_RX,
  .rxfifo         = g_lpuart2rxfifo,
#endif
};

static uart_dev_t g_lpuart2port =
{
  .recv     =
  {
    .size   = CONFIG_LPUART2_RXBUFSIZE,
    .buffer = g_lpuart2rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_LPUART2_TXBUFSIZE,
    .buffer = g_lpuart2txbuffer,
  },
#ifdef CONFIG_KINETIS_LPUART2_RXDMA
  .ops        = &g_lpuart_dma_ops,
#else
  .ops        = &g_lpuart_ops,
#endif
  .priv     = &g_lpuart2priv,
};
#endif

/* This describes the state of the Kinetis LPUART3 port. */

#ifdef CONFIG_KINETIS_LPUART3
static struct kinetis_dev_s g_lpuart3priv =
{
  .uartbase       = KINETIS_LPUART3_BASE,
  .clock          = BOARD_CORECLK_FREQ,
  .baud           = BOARD_LPUART3_FREQ,
  .irq            = KINETIS_IRQ_LPUART3,
  .parity         = CONFIG_LPUART3_PARITY,
  .bits           = CONFIG_LPUART3_BITS,
  .stop2          = CONFIG_LPUART3_2STOP,
  .lock           = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART3_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = PIN_LPUART3_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART3_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = PIN_LPUART3_RTS,
#endif
#ifdef CONFIG_KINETIS_LPUART3_RXDMA
  .rxdma_reqsrc   = KINETIS_DMA_REQUEST_SRC_LPUART3_RX,
  .rxfifo         = g_lpuart3rxfifo,
#endif
};

static uart_dev_t g_lpuart3port =
{
  .recv     =
  {
    .size   = CONFIG_LPUART3_RXBUFSIZE,
    .buffer = g_lpuart3rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_LPUART3_TXBUFSIZE,
    .buffer = g_lpuart3txbuffer,
  },
#ifdef CONFIG_KINETIS_LPUART3_RXDMA
  .ops        = &g_lpuart_dma_ops,
#else
  .ops        = &g_lpuart_ops,
#endif
  .priv     = &g_lpuart3priv,
};
#endif

/* This describes the state of the Kinetis LPUART4 port. */

#ifdef CONFIG_KINETIS_LPUART4
static struct kinetis_dev_s g_lpuart4priv =
{
  .uartbase       = KINETIS_LPUART4_BASE,
  .clock          = BOARD_CORECLK_FREQ,
  .baud           = BOARD_LPUART4_FREQ,
  .irq            = KINETIS_IRQ_LPUART4,
  .parity         = CONFIG_LPUART4_PARITY,
  .bits           = CONFIG_LPUART4_BITS,
  .stop2          = CONFIG_LPUART4_2STOP,
  .lock           = SP_UNLOCKED,
#if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART4_OFLOWCONTROL)
  .oflow         = true,
  .cts_gpio      = PIN_LPUART4_CTS,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART4_IFLOWCONTROL)
  .iflow         = true,
  .rts_gpio      = PIN_LPUART4_RTS,
#endif
#ifdef CONFIG_KINETIS_LPUART4_RXDMA
  .rxdma_reqsrc   = KINETIS_DMA_REQUEST_SRC_LPUART4_RX,
  .rxfifo         = g_lpuart4rxfifo,
#endif
};

static uart_dev_t g_lpuart4port =
{
  .recv     =
  {
    .size   = CONFIG_LPUART4_RXBUFSIZE,
    .buffer = g_lpuart4rxbuffer,
  },
  .xmit     =
  {
    .size   = CONFIG_LPUART4_TXBUFSIZE,
    .buffer = g_lpuart4txbuffer,
  },
#ifdef CONFIG_KINETIS_LPUART4_RXDMA
  .ops        = &g_lpuart_dma_ops,
#else
  .ops        = &g_lpuart_ops,
#endif
  .priv     = &g_lpuart4priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: kinetis_serialin
 ****************************************************************************/

static inline uint32_t kinetis_serialin(struct kinetis_dev_s *priv,
                                        int offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: kinetis_serialout
 ****************************************************************************/

static inline void kinetis_serialout(struct kinetis_dev_s *priv, int offset,
                                     uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: kinetis_setuartint
 ****************************************************************************/

static void kinetis_setuartint(struct kinetis_dev_s *priv)
{
  irqstate_t flags;
  uint32_t regval;

  /* Re-enable/re-disable interrupts corresponding to the state of bits in
   * ie
   */

  flags    = enter_critical_section();
  regval   = kinetis_serialin(priv, KINETIS_LPUART_CTRL_OFFSET);
  regval  &= ~LPUART_CTRL_ALL_INTS;
  regval  |= priv->ie;
  kinetis_serialout(priv, KINETIS_LPUART_CTRL_OFFSET, regval);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: kinetis_restoreuartint
 ****************************************************************************/

static void kinetis_restoreuartint_nolock(struct kinetis_dev_s *priv,
                                          uint32_t ie)
{
  /* Re-enable/re-disable interrupts corresponding to the state of bits in
   * ie
   */

