apache/nuttx/arch/arm/src/kinetis/kinetis_lpserial.c
#ifdef LPSERIAL_HAVE_DMA
void kinetis_lpserial_dma_poll(void)
{
    irqstate_t flags;

    flags = enter_critical_section();

#ifdef CONFIG_KINETIS_LPUART0_RXDMA
  if (g_lpuart0priv.rxdma != NULL)
    {
      kinetis_dma_rxcallback(g_lpuart0priv.rxdma, (void *)&g_lpuart0port,
                             false, 0);
    }
#endif

#ifdef CONFIG_KINETIS_LPUART1_RXDMA
  if (g_lpuart1priv.rxdma != NULL)
    {
      kinetis_dma_rxcallback(g_lpuart1priv.rxdma, (void *)&g_lpuart1port,
                             false, 0);
    }
#endif

#ifdef CONFIG_KINETIS_LPUART2_RXDMA
  if (g_lpuart2priv.rxdma != NULL)
    {
      kinetis_dma_rxcallback(g_lpuart2priv.rxdma, (void *)&g_lpuart2port,
                             false, 0);
    }
#endif

#ifdef CONFIG_KINETIS_LPUART3_RXDMA
  if (g_lpuart3priv.rxdma != NULL)
    {
      kinetis_dma_rxcallback(g_lpuart3priv.rxdma, (void *)&g_lpuart3port,
                             false, 0);
    }
#endif

#ifdef CONFIG_KINETIS_LPUART4_RXDMA
  if (g_lpuart4priv.rxdma != NULL)
    {
      kinetis_dma_rxcallback(g_lpuart4priv.rxdma, (void *)&g_lpuart4port,
                             false, 0);
    }
#endif

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug  writes
 *
 ****************************************************************************/

#ifdef HAVE_LPUART_PUTC
void up_putc(int ch)
{
#ifdef HAVE_LPUART_CONSOLE
  struct kinetis_dev_s *priv = (struct kinetis_dev_s *)CONSOLE_DEV.priv;
  uint32_t ie;

  kinetis_disableuartint(priv, &ie);
  arm_lowputc(ch);
  kinetis_restoreuartint(priv, ie);
#endif
}
#endif

#else /* USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

#ifdef HAVE_LPUART_PUTC
void up_putc(int ch)
{
#ifdef HAVE_LPUART_CONSOLE
  arm_lowputc(ch);
#endif
}
#endif

#endif /* HAVE_LPUART_DEVICE && USE_SERIALDRIVER) */
